c = 0 #начальный счетчик равный 0
n = int(input("vvedyte chislo n ")) #ввод числа n
if n>=1 and n<=25: #проверка числа n на условие задачи
    for i in range(2,n-1): #цикл которой преверяет n на делимость разных чисел
        if n%i == 0: #условие для обновления счетчика
            c +=1 #при выполнении условия счетчик становится на 1 больше
    if c>0: #условие для вывода ответа на проверке счетчика
        print("N") # счетчик больше 0 а значит в цикле нашелся делитель числа n
    else: 
        print("Y") #счетчик равен 0 а значит число n простое
else:
    print("введенное n не попадает в интервал [1,25]") #вывод ошибки если число n не отвечает условиям